Autodesk.Revit.DB.DirectContext3D.IndexStreamPoint.AddPoints(System.Collections.Generic.IList{Autodesk.Revit.DB.DirectContext3D.IndexPoint})
Inserts multiple points into the stream and associated buffer.
points:
The points to be inserted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the associated buffer is not mapped.
-or-
Thrown if the associated buffer has insufficient space.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.IndexStreamPoint.AddPoint(Autodesk.Revit.DB.DirectContext3D.IndexPoint)
Inserts a point into the stream and associated buffer.
point:
The point to be inserted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the associated buffer is not mapped.
-or-
Thrown if the associated buffer has insufficient space.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.IndexStreamPoint
A stream that can be used to write point primitives into a buffer (see Autodesk::Revit::DB::DirectContext3D::IndexBuffer).
Since:
2017